In [185]:
customer_ids = list(range(0,500))

In [186]:
transaction_ids = list(range(5000))

In [187]:
from faker import Faker

In [188]:
fake = Faker()

In [189]:
fake.name()

'Valerie Williams'

In [190]:
customer_names = []
for i in range(len(customer_ids)):
    customer_names.append(fake.name())

In [191]:
join_dates = []
for i in range(len(customer_ids)):
    join_dates.append(fake.date())

In [192]:
customer_types_cat = ["corporate", "private"]

In [193]:
import random
customer_types = []
for i in range(len(customer_ids)):
    customer_types.append(random.choice(customer_types_cat))

In [194]:
import numpy as np
customer_balance = []
for i in range(len(customer_ids)):
    customer_balance.append(abs(np.random.normal()*10000))

In [195]:
customer_birthdate = []
for i in range(len(customer_ids)):
    customer_birthdate.append(fake.date())

In [196]:
gender_types_cat = ["male", "female"]

In [197]:
customer_gender = []
for i in range(len(customer_ids)):
    customer_gender.append(random.choice(gender_types_cat))

In [198]:
pep_types_cat = [True, False]

In [199]:
customer_pep = []
for i in range(len(customer_ids)):
    customer_pep.append(random.choice(pep_types_cat))

In [200]:
number_of_accounts = []
for i in range(len(customer_ids)):
    number_of_accounts.append(np.random.randint(1, 15))

In [201]:
matrix = np.array([customer_names, join_dates, customer_types, customer_balance, customer_birthdate, customer_gender, customer_pep, number_of_accounts])

In [202]:
matrix.shape

(8, 500)

In [203]:
for i in range(8):
    print(len(matrix[i]))

500
500
500
500
500
500
500
500

In [204]:
#matrix[0,:]

In [205]:
import pandas as pd
dataset = pd.DataFrame({
        'name':matrix[0,:],
        'join_date':matrix[1,:],
        'customer_type':matrix[2,:],
        'balance':matrix[3,:],
        "birthdate": matrix[4,:],
        "gender": matrix[5,:],
        "pep": matrix[6,:],
        "number_of_accounts": matrix[7,:]
    })

In [206]:
dataset.head()

,balance,birthdate,customer_type,gender,join_date,name,number_of_accounts,pep
0,3115.0545128937197,2000-10-06,private,male,1997-04-22,Cassidy Stanton,4,False
1,924.2432885105786,2001-09-14,corporate,male,2017-07-18,Jennifer Morris,4,False
2,3315.8305904074336,2012-12-16,corporate,male,1998-12-13,Steven Anderson,8,False
3,2157.433626673071,2006-05-20,private,male,2010-11-14,William Barajas,10,True
4,7277.6426620343245,1993-04-27,corporate,male,1974-11-08,Brittany Martin,6,True

In [207]:
dataset.to_csv("kyc.csv", sep=',', encoding='utf-8',index=False)

In [208]:
trx_in_cust_id = []
for i in range(len(transaction_ids)):
    trx_in_cust_id.append(random.choice(customer_ids))

In [209]:
trx_dates = []
for i in range(len(transaction_ids)):
    trx_dates.append(fake.date())

In [210]:
trx_type_cat = ["ATM", "INTERNATIONAL", "DOMESTIC", "SWISH"]
trx_types = []
for i in range(len(transaction_ids)):
    trx_types.append(random.choice(trx_type_cat))

In [211]:
trx_amount = []
for i in range(len(transaction_ids)):
    trx_amount.append(abs(np.random.normal()*1000))

In [212]:
trx_bankid = []
for i in range(len(transaction_ids)):
    trx_bankid.append(np.random.randint(1, 10000000))

In [213]:
trx_out_cust_id = []
for i in range(len(transaction_ids)):
    counter = trx_in_cust_id[i]
    while counter == trx_in_cust_id[i]:
        counter = random.choice(customer_ids)
    trx_out_cust_id.append(counter)

In [214]:
trx_clearingnum = []
for i in range(len(transaction_ids)):
    trx_clearingnum.append(np.random.randint(1000, 9999))

In [215]:
trx_countries = []
for i in range(len(transaction_ids)):
    trx_countries.append(fake.bank_country())

In [216]:
matrix2 = np.array([trx_in_cust_id, trx_dates, trx_types, trx_amount, trx_bankid, trx_out_cust_id, trx_clearingnum, trx_countries])

In [217]:
import pandas as pd
dataset2 = pd.DataFrame({
        'cust_id_in':matrix2[0,:],
        'trx_date':matrix2[1,:],
        'trx_amount':matrix2[2,:],
        'trx_bankid':matrix2[3,:],
        "cust_id_out": matrix2[4,:],
        "trx_clearinnum": matrix2[5,:],
        "trx_country": matrix2[6,:]
    })

In [218]:
dataset2.head()

,cust_id_in,cust_id_out,trx_amount,trx_bankid,trx_clearinnum,trx_country,trx_date
0,427,7332998,SWISH,1994.4532910946255,355,5285,2013-12-11
1,273,2647435,ATM,1547.3871808040797,312,6621,1983-05-09
2,235,5437112,ATM,947.8322011794437,290,1424,1988-02-14
3,171,9966726,INTERNATIONAL,921.6919021244516,480,6000,2010-05-18
4,269,5092368,ATM,362.52243192238035,246,9545,2009-06-01

In [219]:
dataset2.to_csv("trx.csv", sep=',', encoding='utf-8', index=False)

In [220]:
reports_ids = list(range(100))

In [221]:
report_cust_id = []
for i in range(len(reports_ids)):
    report_cust_id.append(random.choice(customer_ids))

In [222]:
report_dates = []
for i in range(len(reports_ids)):
    report_dates.append(fake.date())

In [223]:
report_description = []
for i in range(len(reports_ids)):
    report_description.append(fake.text())

In [224]:
matrix3 = np.array([reports_ids, report_cust_id, report_dates, report_description])

In [225]:
dataset3 = pd.DataFrame({
        'report_id':matrix3[0,:],
        'cust_id':matrix3[1,:],
        'report_date':matrix3[2,:],
        'description':matrix3[3,:]
    })

In [226]:
dataset3.head()

,cust_id,description,report_date,report_id
0,470,Threat similar technology step station out whi...,2012-10-02,0
1,71,What without general national high early score...,1974-12-04,1
2,130,Me maintain suddenly practice ten prepare. Sta...,1988-11-20,2
3,407,Range tend mouth both. Billion low career. Sto...,1974-01-02,3
4,426,National shake scene focus. Still according mi...,1973-11-21,4

In [227]:
dataset3.to_csv("police_reports.csv", sep=',', encoding='utf-8', index=False)

In [228]:
web_ids = list(range(5000))

In [229]:
web_cust_id = []
for i in range(len(web_ids)):
    web_cust_id.append(random.choice(customer_ids))

In [230]:
web_seconds = []
for i in range(len(web_ids)):
    web_seconds.append(np.random.randint(15, 1000))

In [231]:
ips = [fake.ipv4() for i in range(50)]
#fake.ipv4()

In [232]:
web_address = []
for i in range(len(web_ids)):
    web_address.append(random.choice(ips))

In [233]:
web_actions_cat = ["browse", "transactions", "update_profile", "request_loan", "create_account"]

In [234]:
web_actions = []
for i in range(len(web_ids)):
    web_actions.append(random.choice(web_actions_cat))

In [235]:
matrix4 = np.array([web_ids, web_cust_id, web_seconds, web_address, web_actions])

In [236]:
dataset4 = pd.DataFrame({
        'web_id':matrix4[0,:],
        'cust_id':matrix4[1,:],
        'time_spent_seconds':matrix4[2,:],
        'action':matrix4[3,:],
        "address": matrix4[4,:]
    })

In [237]:
dataset4.head()

           action         address cust_id time_spent_seconds web_id
0   198.58.46.214  update_profile     136                772      0
1    192.0.47.236    transactions     164                592      1
2  192.52.166.132  create_account       9                962      2
3    198.51.123.1  update_profile     230                 67      3
4   202.11.79.229    transactions       6                311      4

In [238]:
dataset4.to_csv("web_logs.csv", sep=',', encoding='utf-8', index=False)

In [239]:
alert_ids = list(range(300))

In [240]:
alert_trx_id = []
for i in range(len(alert_ids)):
    alert_trx_id.append(random.choice(transaction_ids))

In [241]:
alert_date = []
for i in range(len(alert_ids)):
    alert_date.append(fake.date())

In [242]:
alert_type_cat = ["TERRORISM", "HIGH_INT_PAYMENT", "SMURFING", "REPEATED_SWISH"]

In [243]:
alert_types = []
for i in range(len(alert_ids)):
    alert_types.append(random.choice(alert_type_cat))

In [244]:
alert_score = []
for i in range(len(alert_ids)):
    alert_score.append(abs(np.random.normal()))

In [245]:
alert_rule_name_cat = ["TOOK_OVER_4_LOANS_IN_ONE_DAY", "TOOK_LOANS_FROM_MORE_THAN_1_BANK_IN_ONE_DAY", "INT_PAYMENT_OVER_5K", "SMURFING_OVER_5_ACCOUNTS", "SMURFING_OVER_10_ACCOUNTS", "REPEATED_SWISH", "MANY_SWISH_ACCOUNTS"]

In [246]:
rule_names = []
for i in range(len(alert_ids)):
    rule_names.append(random.choice(alert_rule_name_cat))

In [247]:
alert_description = []
for i in range(len(alert_ids)):
    alert_description.append(fake.text())

In [248]:
matrix5 = np.array([alert_ids, alert_trx_id, alert_date, alert_types, alert_score, rule_names, alert_description])

In [249]:
dataset5 = pd.DataFrame({
        'alert_id':matrix5[0,:],
        'trx_id':matrix5[1,:],
        'alert_date':matrix5[2,:],
        'alert_type':matrix5[3,:],
        "alert_score": matrix5[4,:],
        "rule_name": matrix5[5,:],
        "alert_desc": matrix5[6,:],  
    })

In [250]:
dataset5.head()

,alert_date,alert_desc,alert_id,alert_score,alert_type,rule_name,trx_id
0,1984-03-19,Particular along hear soldier growth vote coll...,0,0.8487305279596796,SMURFING,TOOK_OVER_4_LOANS_IN_ONE_DAY,2753
1,2012-05-29,Face green he career. Unit officer accept wher...,1,1.9902632495046184,REPEATED_SWISH,TOOK_LOANS_FROM_MORE_THAN_1_BANK_IN_ONE_DAY,1300
2,2007-02-27,Consider machine particular do argue back born...,2,0.1410329373440852,HIGH_INT_PAYMENT,REPEATED_SWISH,2095
3,2017-08-19,Now before study. From anything property altho...,3,1.0285542680763176,SMURFING,SMURFING_OVER_10_ACCOUNTS,2772
4,1998-10-07,Member program southern scientist. Side day te...,4,0.3959946998435622,HIGH_INT_PAYMENT,TOOK_LOANS_FROM_MORE_THAN_1_BANK_IN_ONE_DAY,2189

In [251]:
dataset5.to_csv("alerts.csv", sep=',', encoding='utf-8', index=False)

In [252]:
corporate_ids = list(range(100))

In [253]:
indudstry_sector_cat = ["AGRICULTURE", "IT", "CONSTRUCTION", "ENERGY", "AEROSPACE", "ENTERTAINMENT"]

In [254]:
industry_sectors = []
for i in range(len(corporate_ids)):
    industry_sectors.append(random.choice(indudstry_sector_cat))

In [255]:
externa_kostnader = []
for i in range(len(corporate_ids)):
    externa_kostnader.append(abs(np.random.normal()*10000))

In [256]:
rente_kostnader = []
for i in range(len(corporate_ids)):
    rente_kostnader.append(abs(np.random.normal()*1000))

In [257]:
netomsettning = []
for i in range(len(corporate_ids)):
    netomsettning.append(abs(np.random.normal()*100000))

In [258]:
netomsettning_3year = []
for i in range(len(corporate_ids)):
    netomsettning_3year.append(abs(np.random.normal()*10000))

In [259]:
netomsettning_2year = []
for i in range(len(corporate_ids)):
    netomsettning_2year.append(abs(np.random.normal()*1000))

In [260]:
netomsettning_1year = []
for i in range(len(corporate_ids)):
    netomsettning_1year.append(abs(np.random.normal()*100))

In [261]:
matrix6 = np.array([corporate_ids, industry_sectors, externa_kostnader, netomsettning, netomsettning_3year, netomsettning_2year, netomsettning_1year])

In [262]:
dataset6 = pd.DataFrame({
        'corporate_id':matrix6[0,:],
        'industry_sector':matrix6[1,:],
        'externa_kostnader':matrix6[2,:],
        'netomsettning':matrix6[3,:],
        "netomsettning_3year": matrix6[4,:],
        "netomsettning_2year": matrix6[5,:],
        "netomsettning_1year": matrix6[6,:],  
    })

In [263]:
dataset6.head()

,corporate_id,externa_kostnader,industry_sector,netomsettning,netomsettning_1year,netomsettning_2year,netomsettning_3year
0,0,4037.106472487839,ENTERTAINMENT,93832.27840824955,44.82092947565074,2022.326251954515,1086.0504833302182
1,1,4675.853425048626,IT,107949.47508358999,88.95741350650822,2016.095213676858,12535.33486043136
2,2,12159.568710998507,IT,50991.56497305206,100.1288353843411,731.9809550995709,1217.4062242438217
3,3,12272.605896410878,ENERGY,54172.17864237209,9.592615488049496,1195.033557934268,2969.9986286433623
4,4,9631.313412510488,CONSTRUCTION,81737.14429032378,53.37891257773608,189.82505752033074,3332.130888767439

In [264]:
dataset6.to_csv("hipo.csv", sep=',', encoding='utf-8', index=False)